export const heartlightPatterns = [
  {
    bits: '00000000',
    patt: '長赤短緑',
  },
  {
    bits: '00000001',
    patt: '長黄短緑',
  },
  {
    bits: '00000101',
    patt: '黄',
  },
  {
    bits: '00000110',
    patt: '長桃短黄',
  },
  {
    bits: '00001001',
    patt: '紫点滅',
  },
  {
    bits: '00001010',
    patt: '長青短黃',
  },
  {
    bits: '00001011',
    patt: '青点滅',
  },
  {
    bits: '00001101',
    patt: '桃黄緑水青紫赤橙(速)',
  },
  {
    bits: '00001111',
    patt: '消灯',
  },
  {
    bits: '00010101',
    patt: '桜点滅',
  },
  {
    bits: '00010110',
    patt: '青点滅',
  },
  {
    bits: '00010111',
    patt: '橙点滅',
  },
  {
    bits: '00011000',
    patt: '桃黄緑水青紫赤橙',
  },
  {
    bits: '00011001',
    patt: '赤橙桃黄緑水青紫',
  },
  {
    bits: '00011010',
    patt: '水点滅',
  },
  {
    bits: '00011011',
    patt: '緑点滅',
  },
  {
    bits: '00100000',
    patt: '紫青',
  },
  {
    bits: '00100011',
    patt: '桃黄緑水青紫赤橙',
  },
  {
    bits: '00100100',
    patt: '緑',
  },
  {
    bits: '00100110',
    patt: '長桃短水',
  },
  {
    bits: '00101000',
    patt: '長桃短赤',
  },
  {
    bits: '00101010',
    patt: '桃黃水',
  },
  {
    bits: '00101110',
    patt: '長黄短桜',
  },
  {
    bits: '00110011',
    patt: '橙桃黄緑水青紫赤',
  },
  {
    bits: '00110100',
    patt: '水',
  },
  {
    bits: '00111001',
    patt: '青紫',
  },
  {
    bits: '00111101',
    patt: '長桜短緑',
  },
  {
    bits: '00111110',
    patt: '消灯',
  },
  {
    bits: '01000000',
    patt: '赤緑点滅(速)',
  },
  {
    bits: '01000001',
    patt: '赤緑点滅(超速)',
  },
  {
    bits: '01000011',
    patt: '長水短黃',
  },
  {
    bits: '01000110',
    patt: '消灯',
  },
  {
    bits: '01001000',
    patt: '長水短黄',
  },
  {
    bits: '01001100',
    patt: '橙',
  },
  {
    bits: '01001101',
    patt: '赤緑点滅(速)',
  },
  {
    bits: '01001110',
    patt: '緑点滅',
  },
  {
    bits: '01010001',
    patt: '橙点滅',
  },
  {
    bits: '01011010',
    patt: '桃黃水',
  },
  {
    bits: '01011101',
    patt: '長黄短桜',
  },
  {
    bits: '01011111',
    patt: '桜点滅',
  },
  {
    bits: '01100011',
    patt: '長桃短赤',
  },
  {
    bits: '01100101',
    patt: '黄点滅',
  },
  {
    bits: '01100110',
    patt: '長桃短水',
  },
  {
    bits: '01101001',
    patt: '赤橙桃黄緑水青紫(速)',
  },
  {
    bits: '01101011',
    patt: '赤点滅',
  },
  {
    bits: '01101110',
    patt: '黄点滅',
  },
  {
    bits: '01101111',
    patt: '桃点滅',
  },
  {
    bits: '01110000',
    patt: '長桜短緑',
  },
  {
    bits: '01110001',
    patt: '紫',
  },
  {
    bits: '01110010',
    patt: '長青短黃',
  },
  {
    bits: '01110011',
    patt: '橙桃黃緑水青紫赤',
  },
  {
    bits: '01110101',
    patt: '赤緑点滅',
  },
  {
    bits: '01110110',
    patt: '紫点滅',
  },
  {
    bits: '01110111',
    patt: '赤点滅',
  },
  {
    bits: '01111000',
    patt: '青',
  },
  {
    bits: '01111001',
    patt: '赤橙桃黄緑水青紫',
  },
  {
    bits: '01111010',
    patt: '長桃短黄',
  },
  {
    bits: '01111011',
    patt: '桃点滅',
  },
  {
    bits: '01111100',
    patt: '桃',
  },
  {
    bits: '01111101',
    patt: '桃黄緑水青紫赤橙',
  },
  {
    bits: '01111110',
    patt: '長桜短赤',
  },
];
